openfoam-case-template/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
1728
(
(-3.91994 -3.91994 0)
(-3.75982 -3.91993 -5.47827e-18)
(-3.5997 -3.91992 9.63655e-20)
(-3.43956 -3.9199 1.85727e-18)
(-3.27943 -3.91987 0)
(-3.11929 -3.91984 3.61532e-18)
(-2.95914 -3.9198 -9.63495e-20)
(-2.799 -3.91975 0)
...
)
;

boundaryField
{
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-4 -3.91994 0)
(-4 -3.75983 0)
(-4 -3.59971 0)
(-4 -3.43959 0)
(-4 -3.27945 0)
(-4 -3.11932 0)
(-4 -2.95918 0)
(-4 -2.79905 0)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(4 -3.91994 0)
(4 -3.75983 0)
(4 -3.59971 0)
(4 -3.43958 0)
(4 -3.27945 0)
(4 -3.11932 0)
(4 -2.95918 0)
(4 -2.79905 0)
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(-3.91994 4 0)
(-3.75983 4 0)
(-3.59971 4 0)
(-3.43959 4 0)
(-3.27945 4 0)
(-3.11932 4 0)
(-2.95918 4 0)
(-2.79905 4 0)
...
)
;
    }
    sides
    {
        type            empty;
    }
    mesh
    {
        type            calculated;
        value           nonuniform List<vector> 
92
(
(-0.209256 -2.49266 0)
(-0.072034 -2.50617 0)
(0.072034 -2.50617 0)
(0.209256 -2.49266 0)
(-0.847185 -2.35672 0)
(-0.71352 -2.39727 0)
(-0.573426 -2.43977 0)
(-0.389178 -2.47355 0)
...
)
;
    }
}


// ************************************************************************* //
