openfoam-case-template/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1728
(
-3.91994
-3.75982
-3.5997
-3.43956
-3.27943
-3.11929
-2.95914
-2.799
...
)
;

boundaryField
{
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-4
-4
-4
-4
-4
-4
-4
-4
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
4
4
4
4
4
4
4
4
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-3.91994
-3.75983
-3.59971
-3.43959
-3.27945
-3.11932
-2.95918
-2.79905
...
)
;
    }
    sides
    {
        type            empty;
    }
    mesh
    {
        type            calculated;
        value           nonuniform List<scalar> 
92
(
-0.209256
-0.072034
0.072034
0.209256
-0.847185
-0.71352
-0.573426
-0.389178
...
)
;
    }
}


// ************************************************************************* //
