openfoam-case-template/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1728
(
-3.91994
-3.91993
-3.91992
-3.9199
-3.91987
-3.91984
-3.9198
-3.91975
...
)
;

boundaryField
{
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-3.91994
-3.75983
-3.59971
-3.43959
-3.27945
-3.11932
-2.95918
-2.79905
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-3.91994
-3.75983
-3.59971
-3.43958
-3.27945
-3.11932
-2.95918
-2.79905
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
4
4
4
4
4
4
4
4
...
)
;
    }
    sides
    {
        type            empty;
    }
    mesh
    {
        type            calculated;
        value           nonuniform List<scalar> 
92
(
-2.49266
-2.50617
-2.50617
-2.49266
-2.35672
-2.39727
-2.43977
-2.47355
...
)
;
    }
}


// ************************************************************************* //
