openfoam-case-template/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{

    mesh.stl
    {
        type triSurfaceMesh;
        name mesh;
    }
};

castellatedMeshControls
{
    maxLocalCells 100000;

    maxGlobalCells 2000000;

    minRefinementCells 0;

    maxLoadUnbalance 0.10;

    nCellsBetweenLevels 1;

    features
    (
        //{
        //    file "someLine.eMesh";
        //    //level 2;
        //    levels ((0.0 2) (1.0 3));
        //}
    );

    refinementSurfaces
    {
        mesh
        {
            level (0 0);
        }
    }

    resolveFeatureAngle 30;
    planarAngle 30;
    refinementRegions
    {
        //box1x1x1
        //{
        //    mode inside;
        //    levels ((1.0 4));
        //}
        //sphere.stl
        //{
        //    mode distance;
        //    levels ((1.0 5) (2.0 3));
        //}
    }

    locationInMesh (3.5001 0.0001 0.0001);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;

    tolerance 2.0;

    nSolveIter 30;

    nRelaxIter 5;

    nFeatureSnapIter 10;

    implicitFeatureSnap false;

    explicitFeatureSnap true;

    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;

    expansionRatio 1.0;

    finalLayerThickness 0.3;

    minThickness 0.25;

    layers
    {
        //sphere.stl_firstSolid
        //{
        //    nSurfaceLayers 1;

        //}
        //maxY
        //{
        //    nSurfaceLayers 1;
        //    expansionRatio      1.3;
        //   finalLayerThickness 0.3;
        //    minThickness        0.1;
        //}

        //frozenPatches
        //{
        //    nSurfaceLayers 0;
        //}
    }

    nGrow 0;

    featureAngle 130;

    maxFaceThicknessRatio 0.5;

    nSmoothSurfaceNormals 1;

    nSmoothThickness 10;

    minMedialAxisAngle 90;

    maxThicknessToMedialRatio 0.3;

    nSmoothNormals 3;

    slipFeatureAngle 30;

    nRelaxIter 5;

    nBufferCellsNoExtrude 0;

    nLayerIter 50;

    nRelaxedIter 20;
}

meshQualityControls
{
    #include "$WM_PROJECT_DIR/etc/caseDicts/meshQualityDict"

    relaxed
    {
        maxNonOrtho 75;
    }

    nSmoothScale 4;

    errorReduction 0.75;
}

mergeTolerance 1e-6;
